ꜱᴇɴᴀᴛᴏʀ:
async def fcmd(self, message): 
        """Используй .jonytor с:""" 
        args = utils.get_args_raw(message) 
        if not args: 
            r = random.randint(0, 5) 
            logger.debug(r) 
            if r == 1: 
                await  
            
             utils.answer(message,.         "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌑🌑🌑🌑🌓🌕🌕\n" 
                                            "🌕🌕🌗🌑🌑🌑🌑🌑🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌑🌑🌑🌓🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌑🌑🌑🌕🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌗🌑🌓🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕\n" 
                                            "🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕🌕")
